GopalSaraf/Practicals/PSDL/include/proc/pic16lf18856.inc
// Register: SMT1TMRU
#define SMT1TMRU SMT1TMRU
SMT1TMRU                                 equ 048Eh
// bitfield definitions
SMT1TMRU_TMR_POSN                        equ 0000h
SMT1TMRU_TMR_POSITION                    equ 0000h
SMT1TMRU_TMR_SIZE                        equ 0008h
SMT1TMRU_TMR_LENGTH                      equ 0008h
SMT1TMRU_TMR_MASK                        equ 00FFh
SMT1TMRU_TMR16_POSN                      equ 0000h
SMT1TMRU_TMR16_POSITION                  equ 0000h
SMT1TMRU_TMR16_SIZE                      equ 0001h
SMT1TMRU_TMR16_LENGTH                    equ 0001h
SMT1TMRU_TMR16_MASK                      equ 0001h
SMT1TMRU_TMR17_POSN                      equ 0001h
SMT1TMRU_TMR17_POSITION                  equ 0001h
SMT1TMRU_TMR17_SIZE                      equ 0001h
SMT1TMRU_TMR17_LENGTH                    equ 0001h
SMT1TMRU_TMR17_MASK                      equ 0002h
SMT1TMRU_TMR18_POSN                      equ 0002h
SMT1TMRU_TMR18_POSITION                  equ 0002h
SMT1TMRU_TMR18_SIZE                      equ 0001h
SMT1TMRU_TMR18_LENGTH                    equ 0001h
SMT1TMRU_TMR18_MASK                      equ 0004h
SMT1TMRU_TMR19_POSN                      equ 0003h
SMT1TMRU_TMR19_POSITION                  equ 0003h
SMT1TMRU_TMR19_SIZE                      equ 0001h
SMT1TMRU_TMR19_LENGTH                    equ 0001h
SMT1TMRU_TMR19_MASK                      equ 0008h
SMT1TMRU_TMR20_POSN                      equ 0004h
SMT1TMRU_TMR20_POSITION                  equ 0004h
SMT1TMRU_TMR20_SIZE                      equ 0001h
SMT1TMRU_TMR20_LENGTH                    equ 0001h
SMT1TMRU_TMR20_MASK                      equ 0010h
SMT1TMRU_TMR21_POSN                      equ 0005h
SMT1TMRU_TMR21_POSITION                  equ 0005h
SMT1TMRU_TMR21_SIZE                      equ 0001h
SMT1TMRU_TMR21_LENGTH                    equ 0001h
SMT1TMRU_TMR21_MASK                      equ 0020h
SMT1TMRU_TMR22_POSN                      equ 0006h
SMT1TMRU_TMR22_POSITION                  equ 0006h
SMT1TMRU_TMR22_SIZE                      equ 0001h
SMT1TMRU_TMR22_LENGTH                    equ 0001h
SMT1TMRU_TMR22_MASK                      equ 0040h
SMT1TMRU_TMR23_POSN                      equ 0007h
SMT1TMRU_TMR23_POSITION                  equ 0007h
SMT1TMRU_TMR23_SIZE                      equ 0001h
SMT1TMRU_TMR23_LENGTH                    equ 0001h
SMT1TMRU_TMR23_MASK                      equ 0080h
SMT1TMRU_SMT1TMR_POSN                    equ 0000h
SMT1TMRU_SMT1TMR_POSITION                equ 0000h
SMT1TMRU_SMT1TMR_SIZE                    equ 0008h
SMT1TMRU_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRU_SMT1TMR_MASK                    equ 00FFh
SMT1TMRU_SMT1TMR16_POSN                  equ 0000h
SMT1TMRU_SMT1TMR16_POSITION              equ 0000h
SMT1TMRU_SMT1TMR16_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR16_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR16_MASK                  equ 0001h
SMT1TMRU_SMT1TMR17_POSN                  equ 0001h
SMT1TMRU_SMT1TMR17_POSITION              equ 0001h
SMT1TMRU_SMT1TMR17_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR17_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR17_MASK                  equ 0002h
SMT1TMRU_SMT1TMR18_POSN                  equ 0002h
SMT1TMRU_SMT1TMR18_POSITION              equ 0002h
SMT1TMRU_SMT1TMR18_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR18_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR18_MASK                  equ 0004h
SMT1TMRU_SMT1TMR19_POSN                  equ 0003h
SMT1TMRU_SMT1TMR19_POSITION              equ 0003h
SMT1TMRU_SMT1TMR19_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR19_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR19_MASK                  equ 0008h
SMT1TMRU_SMT1TMR20_POSN                  equ 0004h
SMT1TMRU_SMT1TMR20_POSITION              equ 0004h
SMT1TMRU_SMT1TMR20_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR20_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR20_MASK                  equ 0010h
SMT1TMRU_SMT1TMR21_POSN                  equ 0005h
SMT1TMRU_SMT1TMR21_POSITION              equ 0005h
SMT1TMRU_SMT1TMR21_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR21_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR21_MASK                  equ 0020h
SMT1TMRU_SMT1TMR22_POSN                  equ 0006h
SMT1TMRU_SMT1TMR22_POSITION              equ 0006h
SMT1TMRU_SMT1TMR22_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR22_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR22_MASK                  equ 0040h
SMT1TMRU_SMT1TMR23_POSN                  equ 0007h
SMT1TMRU_SMT1TMR23_POSITION              equ 0007h
SMT1TMRU_SMT1TMR23_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR23_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR23_MASK                  equ 0080h

// Register: SMT1CPRL
#define SMT1CPRL SMT1CPRL
SMT1CPRL                                 equ 048Fh
// bitfield definitions
SMT1CPRL_CPR_POSN                        equ 0000h
SMT1CPRL_CPR_POSITION                    equ 0000h
SMT1CPRL_CPR_SIZE                        equ 0008h
SMT1CPRL_CPR_LENGTH                      equ 0008h
SMT1CPRL_CPR_MASK                        equ 00FFh
SMT1CPRL_CPR0_POSN                       equ 0000h
SMT1CPRL_CPR0_POSITION                   equ 0000h
SMT1CPRL_CPR0_SIZE                       equ 0001h
SMT1CPRL_CPR0_LENGTH                     equ 0001h
SMT1CPRL_CPR0_MASK                       equ 0001h
SMT1CPRL_CPR1_POSN                       equ 0001h
SMT1CPRL_CPR1_POSITION                   equ 0001h
SMT1CPRL_CPR1_SIZE                       equ 0001h
SMT1CPRL_CPR1_LENGTH                     equ 0001h
SMT1CPRL_CPR1_MASK                       equ 0002h
SMT1CPRL_CPR2_POSN                       equ 0002h
SMT1CPRL_CPR2_POSITION                   equ 0002h
SMT1CPRL_CPR2_SIZE                       equ 0001h
SMT1CPRL_CPR2_LENGTH                     equ 0001h
SMT1CPRL_CPR2_MASK                       equ 0004h
SMT1CPRL_CPR3_POSN                       equ 0003h
SMT1CPRL_CPR3_POSITION                   equ 0003h
SMT1CPRL_CPR3_SIZE                       equ 0001h
SMT1CPRL_CPR3_LENGTH                     equ 0001h
SMT1CPRL_CPR3_MASK                       equ 0008h
SMT1CPRL_CPR4_POSN                       equ 0004h
SMT1CPRL_CPR4_POSITION                   equ 0004h
SMT1CPRL_CPR4_SIZE                       equ 0001h
SMT1CPRL_CPR4_LENGTH                     equ 0001h
SMT1CPRL_CPR4_MASK                       equ 0010h
SMT1CPRL_CPR5_POSN                       equ 0005h
SMT1CPRL_CPR5_POSITION                   equ 0005h
SMT1CPRL_CPR5_SIZE                       equ 0001h
SMT1CPRL_CPR5_LENGTH                     equ 0001h
SMT1CPRL_CPR5_MASK                       equ 0020h
SMT1CPRL_CPR6_POSN                       equ 0006h
SMT1CPRL_CPR6_POSITION                   equ 0006h
SMT1CPRL_CPR6_SIZE                       equ 0001h
SMT1CPRL_CPR6_LENGTH                     equ 0001h
SMT1CPRL_CPR6_MASK                       equ 0040h
SMT1CPRL_CPR7_POSN                       equ 0007h
SMT1CPRL_CPR7_POSITION                   equ 0007h
SMT1CPRL_CPR7_SIZE                       equ 0001h
SMT1CPRL_CPR7_LENGTH                     equ 0001h
SMT1CPRL_CPR7_MASK                       equ 0080h
SMT1CPRL_SMT1CPR_POSN                    equ 0000h
SMT1CPRL_SMT1CPR_POSITION                equ 0000h
SMT1CPRL_SMT1CPR_SIZE                    equ 0008h
SMT1CPRL_SMT1CPR_LENGTH                  equ 0008h
SMT1CPRL_SMT1CPR_MASK                    equ 00FFh
SMT1CPRL_SMT1CPR0_POSN                   equ 0000h
SMT1CPRL_SMT1CPR0_POSITION               equ 0000h
SMT1CPRL_SMT1CPR0_SIZE                   equ 0001h
SMT1CPRL_SMT1CPR0_LENGTH                 equ 0001h
SMT1CPRL_SMT1CPR0_MASK                   equ 0001h
SMT1CPRL_SMT1CPR1_POSN                   equ 0001h
SMT1CPRL_SMT1CPR1_POSITION               equ 0001h
SMT1CPRL_SMT1CPR1_SIZE                   equ 0001h
SMT1CPRL_SMT1CPR1_LENGTH                 equ 0001h
SMT1CPRL_SMT1CPR1_MASK                   equ 0002h
SMT1CPRL_SMT1CPR2_POSN                   equ 0002h
SMT1CPRL_SMT1CPR2_POSITION               equ 0002h
SMT1CPRL_SMT1CPR2_SIZE                   equ 0001h
SMT1CPRL_SMT1CPR2_LENGTH                 equ 0001h
SMT1CPRL_SMT1CPR2_MASK                   equ 0004h
SMT1CPRL_SMT1CPR3_POSN                   equ 0003h
SMT1CPRL_SMT1CPR3_POSITION               equ 0003h
SMT1CPRL_SMT1CPR3_SIZE                   equ 0001h
SMT1CPRL_SMT1CPR3_LENGTH                 equ 0001h
SMT1CPRL_SMT1CPR3_MASK                   equ 0008h
SMT1CPRL_SMT1CPR4_POSN                   equ 0004h
SMT1CPRL_SMT1CPR4_POSITION               equ 0004h
SMT1CPRL_SMT1CPR4_SIZE                   equ 0001h
SMT1CPRL_SMT1CPR4_LENGTH                 equ 0001h
SMT1CPRL_SMT1CPR4_MASK                   equ 0010h
SMT1CPRL_SMT1CPR5_POSN                   equ 0005h
SMT1CPRL_SMT1CPR5_POSITION               equ 0005h
SMT1CPRL_SMT1CPR5_SIZE                   equ 0001h
SMT1CPRL_SMT1CPR5_LENGTH                 equ 0001h
SMT1CPRL_SMT1CPR5_MASK                   equ 0020h
SMT1CPRL_SMT1CPR6_POSN                   equ 0006h
SMT1CPRL_SMT1CPR6_POSITION               equ 0006h
SMT1CPRL_SMT1CPR6_SIZE                   equ 0001h
SMT1CPRL_SMT1CPR6_LENGTH                 equ 0001h
SMT1CPRL_SMT1CPR6_MASK                   equ 0040h
SMT1CPRL_SMT1CPR7_POSN                   equ 0007h
SMT1CPRL_SMT1CPR7_POSITION               equ 0007h
SMT1CPRL_SMT1CPR7_SIZE                   equ 0001h
SMT1CPRL_SMT1CPR7_LENGTH                 equ 0001h
SMT1CPRL_SMT1CPR7_MASK                   equ 0080h

