GopalSaraf/Practicals/PSDL/include/proc/pic16lf18856.inc
// Register: SMT2CON1
#define SMT2CON1 SMT2CON1
SMT2CON1                                 equ 0519h
// bitfield definitions
SMT2CON1_MODE_POSN                       equ 0000h
SMT2CON1_MODE_POSITION                   equ 0000h
SMT2CON1_MODE_SIZE                       equ 0004h
SMT2CON1_MODE_LENGTH                     equ 0004h
SMT2CON1_MODE_MASK                       equ 000Fh
SMT2CON1_REPEAT_POSN                     equ 0006h
SMT2CON1_REPEAT_POSITION                 equ 0006h
SMT2CON1_REPEAT_SIZE                     equ 0001h
SMT2CON1_REPEAT_LENGTH                   equ 0001h
SMT2CON1_REPEAT_MASK                     equ 0040h
SMT2CON1_GO_POSN                         equ 0007h
SMT2CON1_GO_POSITION                     equ 0007h
SMT2CON1_GO_SIZE                         equ 0001h
SMT2CON1_GO_LENGTH                       equ 0001h
SMT2CON1_GO_MASK                         equ 0080h
SMT2CON1_MODE0_POSN                      equ 0000h
SMT2CON1_MODE0_POSITION                  equ 0000h
SMT2CON1_MODE0_SIZE                      equ 0001h
SMT2CON1_MODE0_LENGTH                    equ 0001h
SMT2CON1_MODE0_MASK                      equ 0001h
SMT2CON1_MODE1_POSN                      equ 0001h
SMT2CON1_MODE1_POSITION                  equ 0001h
SMT2CON1_MODE1_SIZE                      equ 0001h
SMT2CON1_MODE1_LENGTH                    equ 0001h
SMT2CON1_MODE1_MASK                      equ 0002h
SMT2CON1_MODE2_POSN                      equ 0002h
SMT2CON1_MODE2_POSITION                  equ 0002h
SMT2CON1_MODE2_SIZE                      equ 0001h
SMT2CON1_MODE2_LENGTH                    equ 0001h
SMT2CON1_MODE2_MASK                      equ 0004h
SMT2CON1_MODE3_POSN                      equ 0003h
SMT2CON1_MODE3_POSITION                  equ 0003h
SMT2CON1_MODE3_SIZE                      equ 0001h
SMT2CON1_MODE3_LENGTH                    equ 0001h
SMT2CON1_MODE3_MASK                      equ 0008h
SMT2CON1_SMT2REPEAT_POSN                 equ 0006h
SMT2CON1_SMT2REPEAT_POSITION             equ 0006h
SMT2CON1_SMT2REPEAT_SIZE                 equ 0001h
SMT2CON1_SMT2REPEAT_LENGTH               equ 0001h
SMT2CON1_SMT2REPEAT_MASK                 equ 0040h
SMT2CON1_SMT2GO_POSN                     equ 0007h
SMT2CON1_SMT2GO_POSITION                 equ 0007h
SMT2CON1_SMT2GO_SIZE                     equ 0001h
SMT2CON1_SMT2GO_LENGTH                   equ 0001h
SMT2CON1_SMT2GO_MASK                     equ 0080h
SMT2CON1_SMT2MODE_POSN                   equ 0000h
SMT2CON1_SMT2MODE_POSITION               equ 0000h
SMT2CON1_SMT2MODE_SIZE                   equ 0004h
SMT2CON1_SMT2MODE_LENGTH                 equ 0004h
SMT2CON1_SMT2MODE_MASK                   equ 000Fh

// Register: SMT2STAT
#define SMT2STAT SMT2STAT
SMT2STAT                                 equ 051Ah
// bitfield definitions
SMT2STAT_AS_POSN                         equ 0000h
SMT2STAT_AS_POSITION                     equ 0000h
SMT2STAT_AS_SIZE                         equ 0001h
SMT2STAT_AS_LENGTH                       equ 0001h
SMT2STAT_AS_MASK                         equ 0001h
SMT2STAT_WS_POSN                         equ 0001h
SMT2STAT_WS_POSITION                     equ 0001h
SMT2STAT_WS_SIZE                         equ 0001h
SMT2STAT_WS_LENGTH                       equ 0001h
SMT2STAT_WS_MASK                         equ 0002h
SMT2STAT_TS_POSN                         equ 0002h
SMT2STAT_TS_POSITION                     equ 0002h
SMT2STAT_TS_SIZE                         equ 0001h
SMT2STAT_TS_LENGTH                       equ 0001h
SMT2STAT_TS_MASK                         equ 0004h
SMT2STAT_RST_POSN                        equ 0005h
SMT2STAT_RST_POSITION                    equ 0005h
SMT2STAT_RST_SIZE                        equ 0001h
SMT2STAT_RST_LENGTH                      equ 0001h
SMT2STAT_RST_MASK                        equ 0020h
SMT2STAT_CPWUP_POSN                      equ 0006h
SMT2STAT_CPWUP_POSITION                  equ 0006h
SMT2STAT_CPWUP_SIZE                      equ 0001h
SMT2STAT_CPWUP_LENGTH                    equ 0001h
SMT2STAT_CPWUP_MASK                      equ 0040h
SMT2STAT_CPRUP_POSN                      equ 0007h
SMT2STAT_CPRUP_POSITION                  equ 0007h
SMT2STAT_CPRUP_SIZE                      equ 0001h
SMT2STAT_CPRUP_LENGTH                    equ 0001h
SMT2STAT_CPRUP_MASK                      equ 0080h
SMT2STAT_SMT2AS_POSN                     equ 0000h
SMT2STAT_SMT2AS_POSITION                 equ 0000h
SMT2STAT_SMT2AS_SIZE                     equ 0001h
SMT2STAT_SMT2AS_LENGTH                   equ 0001h
SMT2STAT_SMT2AS_MASK                     equ 0001h
SMT2STAT_SMT2WS_POSN                     equ 0001h
SMT2STAT_SMT2WS_POSITION                 equ 0001h
SMT2STAT_SMT2WS_SIZE                     equ 0001h
SMT2STAT_SMT2WS_LENGTH                   equ 0001h
SMT2STAT_SMT2WS_MASK                     equ 0002h
SMT2STAT_SMT2TS_POSN                     equ 0002h
SMT2STAT_SMT2TS_POSITION                 equ 0002h
SMT2STAT_SMT2TS_SIZE                     equ 0001h
SMT2STAT_SMT2TS_LENGTH                   equ 0001h
SMT2STAT_SMT2TS_MASK                     equ 0004h
SMT2STAT_SMT2RESET_POSN                  equ 0005h
SMT2STAT_SMT2RESET_POSITION              equ 0005h
SMT2STAT_SMT2RESET_SIZE                  equ 0001h
SMT2STAT_SMT2RESET_LENGTH                equ 0001h
SMT2STAT_SMT2RESET_MASK                  equ 0020h
SMT2STAT_SMT2CPWUP_POSN                  equ 0006h
SMT2STAT_SMT2CPWUP_POSITION              equ 0006h
SMT2STAT_SMT2CPWUP_SIZE                  equ 0001h
SMT2STAT_SMT2CPWUP_LENGTH                equ 0001h
SMT2STAT_SMT2CPWUP_MASK                  equ 0040h
SMT2STAT_SMT2CPRUP_POSN                  equ 0007h
SMT2STAT_SMT2CPRUP_POSITION              equ 0007h
SMT2STAT_SMT2CPRUP_SIZE                  equ 0001h
SMT2STAT_SMT2CPRUP_LENGTH                equ 0001h
SMT2STAT_SMT2CPRUP_MASK                  equ 0080h
SMT2STAT_SMT2RST_POSN                    equ 0005h
SMT2STAT_SMT2RST_POSITION                equ 0005h
SMT2STAT_SMT2RST_SIZE                    equ 0001h
SMT2STAT_SMT2RST_LENGTH                  equ 0001h
SMT2STAT_SMT2RST_MASK                    equ 0020h

// Register: SMT2CLK
#define SMT2CLK SMT2CLK
SMT2CLK                                  equ 051Bh
// bitfield definitions
SMT2CLK_CSEL_POSN                        equ 0000h
SMT2CLK_CSEL_POSITION                    equ 0000h
SMT2CLK_CSEL_SIZE                        equ 0003h
SMT2CLK_CSEL_LENGTH                      equ 0003h
SMT2CLK_CSEL_MASK                        equ 0007h
SMT2CLK_CSEL0_POSN                       equ 0000h
SMT2CLK_CSEL0_POSITION                   equ 0000h
SMT2CLK_CSEL0_SIZE                       equ 0001h
SMT2CLK_CSEL0_LENGTH                     equ 0001h
SMT2CLK_CSEL0_MASK                       equ 0001h
SMT2CLK_CSEL1_POSN                       equ 0001h
SMT2CLK_CSEL1_POSITION                   equ 0001h
SMT2CLK_CSEL1_SIZE                       equ 0001h
SMT2CLK_CSEL1_LENGTH                     equ 0001h
SMT2CLK_CSEL1_MASK                       equ 0002h
SMT2CLK_CSEL2_POSN                       equ 0002h
SMT2CLK_CSEL2_POSITION                   equ 0002h
SMT2CLK_CSEL2_SIZE                       equ 0001h
SMT2CLK_CSEL2_LENGTH                     equ 0001h
SMT2CLK_CSEL2_MASK                       equ 0004h
SMT2CLK_SMT2CSEL_POSN                    equ 0000h
SMT2CLK_SMT2CSEL_POSITION                equ 0000h
SMT2CLK_SMT2CSEL_SIZE                    equ 0003h
SMT2CLK_SMT2CSEL_LENGTH                  equ 0003h
SMT2CLK_SMT2CSEL_MASK                    equ 0007h
SMT2CLK_SMT2CSEL0_POSN                   equ 0000h
SMT2CLK_SMT2CSEL0_POSITION               equ 0000h
SMT2CLK_SMT2CSEL0_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL0_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL0_MASK                   equ 0001h
SMT2CLK_SMT2CSEL1_POSN                   equ 0001h
SMT2CLK_SMT2CSEL1_POSITION               equ 0001h
SMT2CLK_SMT2CSEL1_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL1_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL1_MASK                   equ 0002h
SMT2CLK_SMT2CSEL2_POSN                   equ 0002h
SMT2CLK_SMT2CSEL2_POSITION               equ 0002h
SMT2CLK_SMT2CSEL2_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL2_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL2_MASK                   equ 0004h

// Register: SMT2SIG
#define SMT2SIG SMT2SIG
SMT2SIG                                  equ 051Ch
// bitfield definitions
SMT2SIG_SSEL_POSN                        equ 0000h
SMT2SIG_SSEL_POSITION                    equ 0000h
SMT2SIG_SSEL_SIZE                        equ 0005h
SMT2SIG_SSEL_LENGTH                      equ 0005h
SMT2SIG_SSEL_MASK                        equ 001Fh
SMT2SIG_SSEL0_POSN                       equ 0000h
SMT2SIG_SSEL0_POSITION                   equ 0000h
SMT2SIG_SSEL0_SIZE                       equ 0001h
SMT2SIG_SSEL0_LENGTH                     equ 0001h
SMT2SIG_SSEL0_MASK                       equ 0001h
SMT2SIG_SSEL1_POSN                       equ 0001h
SMT2SIG_SSEL1_POSITION                   equ 0001h
SMT2SIG_SSEL1_SIZE                       equ 0001h
SMT2SIG_SSEL1_LENGTH                     equ 0001h
SMT2SIG_SSEL1_MASK                       equ 0002h
SMT2SIG_SSEL2_POSN                       equ 0002h
SMT2SIG_SSEL2_POSITION                   equ 0002h
SMT2SIG_SSEL2_SIZE                       equ 0001h
SMT2SIG_SSEL2_LENGTH                     equ 0001h
SMT2SIG_SSEL2_MASK                       equ 0004h
SMT2SIG_SSEL3_POSN                       equ 0003h
SMT2SIG_SSEL3_POSITION                   equ 0003h
SMT2SIG_SSEL3_SIZE                       equ 0001h
SMT2SIG_SSEL3_LENGTH                     equ 0001h
SMT2SIG_SSEL3_MASK                       equ 0008h
SMT2SIG_SSEL4_POSN                       equ 0004h
SMT2SIG_SSEL4_POSITION                   equ 0004h
SMT2SIG_SSEL4_SIZE                       equ 0001h
SMT2SIG_SSEL4_LENGTH                     equ 0001h
SMT2SIG_SSEL4_MASK                       equ 0010h
SMT2SIG_SMT2SSEL_POSN                    equ 0000h
SMT2SIG_SMT2SSEL_POSITION                equ 0000h
SMT2SIG_SMT2SSEL_SIZE                    equ 0005h
SMT2SIG_SMT2SSEL_LENGTH                  equ 0005h
SMT2SIG_SMT2SSEL_MASK                    equ 001Fh
SMT2SIG_SMT2SSEL0_POSN                   equ 0000h
SMT2SIG_SMT2SSEL0_POSITION               equ 0000h
SMT2SIG_SMT2SSEL0_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL0_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL0_MASK                   equ 0001h
SMT2SIG_SMT2SSEL1_POSN                   equ 0001h
SMT2SIG_SMT2SSEL1_POSITION               equ 0001h
SMT2SIG_SMT2SSEL1_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL1_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL1_MASK                   equ 0002h
SMT2SIG_SMT2SSEL2_POSN                   equ 0002h
SMT2SIG_SMT2SSEL2_POSITION               equ 0002h
SMT2SIG_SMT2SSEL2_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL2_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL2_MASK                   equ 0004h
SMT2SIG_SMT2SSEL3_POSN                   equ 0003h
SMT2SIG_SMT2SSEL3_POSITION               equ 0003h
SMT2SIG_SMT2SSEL3_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL3_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL3_MASK                   equ 0008h
SMT2SIG_SMT2SSEL4_POSN                   equ 0004h
SMT2SIG_SMT2SSEL4_POSITION               equ 0004h
SMT2SIG_SMT2SSEL4_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL4_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL4_MASK                   equ 0010h

// Register: SMT2WIN
#define SMT2WIN SMT2WIN
SMT2WIN                                  equ 051Dh
// bitfield definitions
SMT2WIN_WSEL_POSN                        equ 0000h
SMT2WIN_WSEL_POSITION                    equ 0000h
SMT2WIN_WSEL_SIZE                        equ 0005h
SMT2WIN_WSEL_LENGTH                      equ 0005h
SMT2WIN_WSEL_MASK                        equ 001Fh
SMT2WIN_WSEL0_POSN                       equ 0000h
SMT2WIN_WSEL0_POSITION                   equ 0000h
SMT2WIN_WSEL0_SIZE                       equ 0001h
SMT2WIN_WSEL0_LENGTH                     equ 0001h
SMT2WIN_WSEL0_MASK                       equ 0001h
SMT2WIN_WSEL1_POSN                       equ 0001h
SMT2WIN_WSEL1_POSITION                   equ 0001h
SMT2WIN_WSEL1_SIZE                       equ 0001h
SMT2WIN_WSEL1_LENGTH                     equ 0001h
SMT2WIN_WSEL1_MASK                       equ 0002h
SMT2WIN_WSEL2_POSN                       equ 0002h
SMT2WIN_WSEL2_POSITION                   equ 0002h
SMT2WIN_WSEL2_SIZE                       equ 0001h
SMT2WIN_WSEL2_LENGTH                     equ 0001h
SMT2WIN_WSEL2_MASK                       equ 0004h
SMT2WIN_WSEL3_POSN                       equ 0003h
SMT2WIN_WSEL3_POSITION                   equ 0003h
SMT2WIN_WSEL3_SIZE                       equ 0001h
SMT2WIN_WSEL3_LENGTH                     equ 0001h
SMT2WIN_WSEL3_MASK                       equ 0008h
SMT2WIN_WSEL4_POSN                       equ 0004h
SMT2WIN_WSEL4_POSITION                   equ 0004h
SMT2WIN_WSEL4_SIZE                       equ 0001h
SMT2WIN_WSEL4_LENGTH                     equ 0001h
SMT2WIN_WSEL4_MASK                       equ 0010h
SMT2WIN_SMT2WSEL_POSN                    equ 0000h
SMT2WIN_SMT2WSEL_POSITION                equ 0000h
SMT2WIN_SMT2WSEL_SIZE                    equ 0005h
SMT2WIN_SMT2WSEL_LENGTH                  equ 0005h
SMT2WIN_SMT2WSEL_MASK                    equ 001Fh
SMT2WIN_SMT2WSEL0_POSN                   equ 0000h
SMT2WIN_SMT2WSEL0_POSITION               equ 0000h
SMT2WIN_SMT2WSEL0_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL0_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL0_MASK                   equ 0001h
SMT2WIN_SMT2WSEL1_POSN                   equ 0001h
SMT2WIN_SMT2WSEL1_POSITION               equ 0001h
SMT2WIN_SMT2WSEL1_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL1_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL1_MASK                   equ 0002h
SMT2WIN_SMT2WSEL2_POSN                   equ 0002h
SMT2WIN_SMT2WSEL2_POSITION               equ 0002h
SMT2WIN_SMT2WSEL2_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL2_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL2_MASK                   equ 0004h
SMT2WIN_SMT2WSEL3_POSN                   equ 0003h
SMT2WIN_SMT2WSEL3_POSITION               equ 0003h
SMT2WIN_SMT2WSEL3_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL3_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL3_MASK                   equ 0008h
SMT2WIN_SMT2WSEL4_POSN                   equ 0004h
SMT2WIN_SMT2WSEL4_POSITION               equ 0004h
SMT2WIN_SMT2WSEL4_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL4_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL4_MASK                   equ 0010h

